---
kind: other
id: Properties.T:Autodesk.Revit.DB.RPCNode
source: html/b9f876da-3673-cc05-ce7f-55b1a5fd0960.htm
---
# RPCNode Properties

Specifies whether the .NET object represents a valid Revit entity.